quiz_data_english = [
    {
        "statement": "You can’t get pregnant the first time you have sex.",
        "is_myth": True,
        "explanation": "Myth! You can get pregnant anytime you have unprotected sex — even the first time.",
        "age_group": "14-17"
    },
    {
        "statement": "Condoms protect against both pregnancy and STIs.",
        "is_myth": False,
        "explanation": "Fact! When used correctly, condoms reduce the risk of both pregnancy and many STIs.",
        "age_group": "14-17"
    },
    {
        "statement": "Using two condoms gives double protection.",
        "is_myth": True,
        "explanation": "Myth! Using two condoms can cause friction between them and increase the chance of breakage.",
        "age_group": "18+"
    },
    {
        "statement": "HIV can be transmitted through mosquito bites.",
        "is_myth": True,
        "explanation": "Myth! HIV cannot be spread by mosquitoes — it only spreads through certain body fluids.",
        "age_group": "10-13"
    },
    {
        "statement": "Taking a shower or urinating after sex can prevent pregnancy.",
        "is_myth": True,
        "explanation": "Myth! Neither bathing nor urinating after sex can prevent pregnancy.",
        "age_group": "14-17"
    },
    {
        "statement": "Only promiscuous people get sexually transmitted infections (STIs).",
        "is_myth": True,
        "explanation": "Myth! Anyone who is sexually active can get an STI, regardless of the number of partners.",
        "age_group": "14-17"
    },
    {
        "statement": "Birth control pills can make a woman infertile.",
        "is_myth": True,
        "explanation": "Myth! Birth control pills are reversible and do not cause permanent infertility.",
        "age_group": "18+"
    },
    {
        "statement": "STIs always show symptoms.",
        "is_myth": True,
        "explanation": "Myth! Many STIs have no symptoms. That’s why regular testing is important.",
        "age_group": "14-17"
    },
    {
        "statement": "You can’t get an STI if you and your partner are both virgins.",
        "is_myth": False,
        "explanation": "Fact! If neither partner has engaged in any sexual activity, the risk of STIs is extremely low.",
        "age_group": "14-17"
    },
    {
        "statement": "Withdrawal (pull-out method) is a reliable form of contraception.",
        "is_myth": True,
        "explanation": "Myth! Withdrawal is very risky and not reliable, as pre-ejaculate can contain sperm.",
        "age_group": "14-17"
    },
    {
        "statement": "HPV (Human Papillomavirus) can lead to cervical cancer.",
        "is_myth": False,
        "explanation": "Fact! Certain types of HPV can cause cervical cancer, which is why vaccination is important.",
        "age_group": "14-17"
    },
    {
        "statement": "You don’t need to use protection during oral sex.",
        "is_myth": True,
        "explanation": "Myth! STIs can still be transmitted through oral sex — protection is advised.",
        "age_group": "18+"
    },
    {
        "statement": "Men cannot get the HPV virus.",
        "is_myth": True,
        "explanation": "Myth! Men can also be infected with HPV and may develop related health issues.",
        "age_group": "14-17"
    },
    {
        "statement": "Emergency contraception can only be used the day after sex.",
        "is_myth": True,
        "explanation": "Myth! Emergency contraception can be effective for up to 3–5 days after unprotected sex.",
        "age_group": "18+"
    },
    {
        "statement": "A girl cannot get pregnant during her period.",
        "is_myth": True,
        "explanation": "Myth! It’s rare, but possible to get pregnant during menstruation due to sperm living several days in the body.",
        "age_group": "14-17"
    },
    {
        "statement": "You can tell if someone has an STI just by looking at them.",
        "is_myth": True,
        "explanation": "Myth! Most STIs don’t show visible symptoms, so testing is the only way to know.",
        "age_group": "14-17"
    },
    {
        "statement": "Condoms can expire and should be discarded after the expiration date.",
        "is_myth": False,
        "explanation": "Fact! Using an expired condom risks it breaking — always check the date.",
        "age_group": "14-17"
    },
    {
        "statement": "Douching after sex helps prevent STIs.",
        "is_myth": True,
        "explanation": "Myth! Douching doesn’t protect against STIs and can upset vaginal balance.",
        "age_group": "18+"
    },
    {
        "statement": "The morning-after pill is the same as abortion.",
        "is_myth": True,
        "explanation": "Myth! Emergency contraception prevents pregnancy; it doesn't terminate it.",
        "age_group": "18+"
    },
    {
        "statement": "HIV can be transmitted through sharing a toothbrush or a towel.",
        "is_myth": True,
        "explanation": "Myth! HIV isn’t spread by casual contact—only via blood, semen, vaginal fluids, or breast milk.",
        "age_group": "10-13"
    },
    {
        "statement": "Using birth control pills protects against STIs.",
        "is_myth": True,
        "explanation": "Myth! Pills prevent pregnancy only — they don’t protect against STIs.",
        "age_group": "14-17"
    },
    {
        "statement": "You can't get an STI from a toilet seat.",
        "is_myth": False,
        "explanation": "Fact! STIs don’t live long on surfaces and are not transmitted through toilet seats.",
        "age_group": "14-17"
    },
    {
        "statement": "Taking birth control causes weight gain in everyone.",
        "is_myth": True,
        "explanation": "Myth! Not everyone gains weight — effects vary depending on the individual and the type of birth control.",
        "age_group": "18+"
    },
    {
        "statement": "Only people who sleep around need STI tests.",
        "is_myth": True,
        "explanation": "Myth! Anyone who is sexually active should consider regular STI testing, regardless of their number of partners.",
        "age_group": "18+"
    },
    {
        "statement": "STIs can affect your fertility.",
        "is_myth": False,
        "explanation": "Fact! Untreated STIs like chlamydia and gonorrhea can cause fertility problems.",
        "age_group": "18+"
    },
    {
        "statement": "You can’t get HIV if both partners are healthy-looking.",
        "is_myth": True,
        "explanation": "Myth! People with HIV often show no symptoms — only testing can confirm HIV status.",
        "age_group": "14-17"
    },
    {
        "statement": "Only women need to worry about contraception.",
        "is_myth": True,
        "explanation": "Myth! Preventing pregnancy and STIs is a shared responsibility between partners.",
        "age_group": "14-17"
    },
    {
        "statement": "STIs are less dangerous for men than women.",
        "is_myth": True,
        "explanation": "Myth! STIs can cause serious health issues in all genders if left untreated.",
        "age_group": "14-17"
    },
    {
        "statement": "You can get pregnant even if it's your first time having sex.",
        "is_myth": False,
        "explanation": "Fact! Pregnancy can happen any time there's unprotected sex — even the first time.",
        "age_group": "14-17"
    },
    {
        "statement": "You should see a doctor immediately if you think you have an STI.",
        "is_myth": False,
        "explanation": "Fact! Early treatment can prevent complications and stop spread to others.",
        "age_group": "18+"
    },
    {
        "statement": "Talking about sex with a partner ruins the mood.",
        "is_myth": True,
        "explanation": "Myth! Open communication builds trust, safety, and a better sexual experience.",
        "age_group": "18+"
    },
    {
        "statement": "You can get an STI the first time you have sex.",
        "is_myth": False,
        "explanation": "Fact! STIs can be passed during any unprotected sexual contact, even the first time.",
        "age_group": "10-13"
    },
    {
        "statement": "You can’t get pregnant if it’s your first time having sex.",
        "is_myth": True,
        "explanation": "Myth! Pregnancy can happen anytime there's unprotected sex — even the first time.",
        "age_group": "10-13"
    },
    {
        "statement": "You can tell if someone has an STI just by looking at them.",
        "is_myth": True,
        "explanation": "Myth! Many STIs don’t show visible signs. Only testing can confirm if someone has an STI.",
        "age_group": "10-13"
    },
    {
        "statement": "HIV can be spread through blood.",
        "is_myth": False,
        "explanation": "Fact! HIV can be spread through blood, as well as semen, vaginal fluids, and breast milk.",
        "age_group": "10-13"
    },
    {
        "statement": "You can’t get HIV from hugging, sharing food, or using the same toilet.",
        "is_myth": False,
        "explanation": "Fact! HIV is not spread through casual contact like hugging or sharing a toilet.",
        "age_group": "10-13"
    },
    {
        "statement": "Girls can’t get pregnant during their period.",
        "is_myth": True,
        "explanation": "Myth! It’s rare, but possible — sperm can live in the body for several days.",
        "age_group": "10-13"
    },
    {
        "statement": "Only girls need to learn about STIs and pregnancy.",
        "is_myth": True,
        "explanation": "Myth! Everyone should understand how STIs and pregnancy happen and how to prevent them.",
        "age_group": "10-13"
    },
    {
        "statement": "You can get an STI from oral sex.",
        "is_myth": False,
        "explanation": "Fact! STIs can be passed through all types of unprotected sexual contact.",
        "age_group": "10-13"
    },
    {
        "statement": "You can’t get pregnant from kissing or holding hands.",
        "is_myth": False,
        "explanation": "Fact! Pregnancy can only happen from vaginal sex, not from kissing or touching.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs only happen to people who don’t shower or stay clean.",
        "is_myth": True,
        "explanation": "Myth! STIs are passed through sexual contact — not because someone is 'dirty'.",
        "age_group": "10-13"
    },
    {
        "statement": "Condoms help protect against both pregnancy and STIs.",
        "is_myth": False,
        "explanation": "Fact! When used correctly, condoms help prevent both pregnancy and many STIs.",
        "age_group": "10-13"
    },
    {
        "statement": "Only adults can get STIs.",
        "is_myth": True,
        "explanation": "Myth! Anyone who is sexually active, including teens, can get an STI.",
        "age_group": "10-13"
    },
    {
        "statement": "You can't get an STI if both partners are virgins.",
        "is_myth": False,
        "explanation": "Fact! If neither person has had any sexual contact, the risk of STI is very low.",
        "age_group": "10-13"
    },
    {
        "statement": "There are vaccines to prevent some STIs.",
        "is_myth": False,
        "explanation": "Fact! The HPV vaccine, for example, can help protect against certain cancers caused by HPV.",
        "age_group": "10-13"
    },
    {
        "statement": "You can get HIV from a mosquito bite.",
        "is_myth": True,
        "explanation": "Myth! HIV cannot be spread by mosquitoes — only through specific body fluids.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs always have symptoms like itching or discharge.",
        "is_myth": True,
        "explanation": "Myth! Many STIs have no symptoms — which is why testing is important.",
        "age_group": "10-13"
    },
    {
        "statement": "Using two condoms at once gives better protection.",
        "is_myth": True,
        "explanation": "Myth! Using two condoms can cause friction and make them more likely to break.",
        "age_group": "10-13"
    },
    {
        "statement": "People with HIV can live long, healthy lives with treatment.",
        "is_myth": False,
        "explanation": "Fact! HIV is treatable, and with medicine, many people live full lives.",
        "age_group": "10-13"
    },
    {
        "statement": "Only people with lots of partners get STIs.",
        "is_myth": True,
        "explanation": "Myth! Anyone who is sexually active can get an STI, even with one partner.",
        "age_group": "10-13"
    },
    {
        "statement": "Washing after sex prevents pregnancy.",
        "is_myth": True,
        "explanation": "Myth! Washing doesn’t prevent pregnancy or STIs — only protection does.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs can be cured with antibiotics.",
        "is_myth": False,
        "explanation": "Fact! Many STIs like chlamydia or gonorrhea can be cured — but others like HIV cannot.",
        "age_group": "10-13"
    },
    {
        "statement": "Toilet seats can spread STIs.",
        "is_myth": True,
        "explanation": "Myth! STIs don’t live long on surfaces and aren’t spread by toilet seats.",
        "age_group": "10-13"
    },
    {
        "statement": "It’s important to talk to a trusted adult if you’re confused about sex, STIs, or pregnancy.",
        "is_myth": False,
        "explanation": "Fact! Trusted adults can give you correct, helpful information.",
        "age_group": "10-13"
    },
    {
        "statement": "You can get pregnant if sperm gets near the vagina, even without full sex.",
        "is_myth": False,
        "explanation": "Fact! Pregnancy is possible if sperm enters the vagina, even without full intercourse.",
        "age_group": "10-13"
    },
    {
        "statement": "Birth control pills protect against STIs.",
        "is_myth": True,
        "explanation": "Myth! Birth control pills prevent pregnancy but not STIs.",
        "age_group": "10-13"
    },
    {
        "statement": "People with STIs always know they have one.",
        "is_myth": True,
        "explanation": "Myth! Many people don’t have symptoms and may not know unless they get tested.",
        "age_group": "10-13"
    },
    {
        "statement": "The only 100% way to avoid STIs and pregnancy is not having sex.",
        "is_myth": False,
        "explanation": "Fact! Abstinence is the only guaranteed way to avoid pregnancy and STIs.",
        "age_group": "10-13"
    },
    {
        "statement": "You can get STIs from sharing drinks.",
        "is_myth": True,
        "explanation": "Myth! STIs don’t spread through cups or drinks — only through sexual contact or body fluids.",
        "age_group": "10-13"
    },
    {
        "statement": "Only adults should get tested for STIs.",
        "is_myth": True,
        "explanation": "Myth! Anyone who is sexually active, no matter their age, should consider STI testing.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs can make it harder to have children later.",
        "is_myth": False,
        "explanation": "Fact! Untreated STIs can cause fertility problems later in life.",
        "age_group": "10-13"
    },
    {
        "statement": "You can still get pregnant even if your partner pulls out before ejaculation.",
        "is_myth": True,
        "explanation": "Myth! Pre-ejaculate can contain sperm, so the pull-out method is not reliable.",
        "age_group": "18+"
    },
    {
        "statement": "Birth control methods like the pill do not protect against STIs.",
        "is_myth": False,
        "explanation": "Fact! Most hormonal birth control methods prevent pregnancy, not STIs. Use condoms for STI protection.",
        "age_group": "18+"
    },
    {
        "statement": "You can’t get an STI from someone who looks healthy.",
        "is_myth": True,
        "explanation": "Myth! Many people with STIs have no symptoms at all — testing is the only way to know.",
        "age_group": "18+"
    },
    {
        "statement": "HPV is the most common STI and can affect all genders.",
        "is_myth": False,
        "explanation": "Fact! HPV is very common, and both men and women can carry and transmit it.",
        "age_group": "18+"
    },
    {
        "statement": "Using condoms correctly every time you have sex greatly lowers your risk of STIs and pregnancy.",
        "is_myth": False,
        "explanation": "Fact! Condoms are highly effective when used consistently and correctly.",
        "age_group": "18+"
    },
    {
        "statement": "Emergency contraception causes an abortion.",
        "is_myth": True,
        "explanation": "Myth! Emergency contraception prevents pregnancy — it does not end one.",
        "age_group": "18+"
    },
    {
        "statement": "Most STIs are curable with treatment.",
        "is_myth": False,
        "explanation": "Fact! Many STIs (like chlamydia and gonorrhea) can be cured, while others (like herpes or HIV) are manageable.",
        "age_group": "18+"
    },
    {
        "statement": "You don’t need to get tested for STIs if you're in a long-term relationship.",
        "is_myth": True,
        "explanation": "Myth! It’s still important to test, especially if neither partner was tested before the relationship began.",
        "age_group": "18+"
    },
    {
        "statement": "You can get an STI from oral and anal sex.",
        "is_myth": False,
        "explanation": "Fact! STIs can be transmitted through all forms of sexual contact without protection.",
        "age_group": "18+"
    },
    {
        "statement": "Men can’t carry or transmit HPV.",
        "is_myth": True,
        "explanation": "Myth! Men can carry and transmit HPV, even without symptoms.",
        "age_group": "18+"
    },
    {
        "statement": "Using lube with condoms can help prevent breakage.",
        "is_myth": False,
        "explanation": "Fact! Water- or silicone-based lube can reduce friction and help keep condoms from breaking.",
        "age_group": "18+"
    },
    {
        "statement": "Doubling up on condoms gives you more protection.",
        "is_myth": True,
        "explanation": "Myth! Using two condoms at once increases friction and the chance of breakage.",
        "age_group": "18+"
    },
    {
        "statement": "HIV is no longer a life-threatening condition with proper treatment.",
        "is_myth": False,
        "explanation": "Fact! Antiretroviral therapy allows people with HIV to live long, healthy lives.",
        "age_group": "18+"
    },
    {
        "statement": "Birth control can cause infertility.",
        "is_myth": True,
        "explanation": "Myth! Most birth control methods are reversible and do not cause long-term fertility issues.",
        "age_group": "18+"
    },
    {
        "statement": "You can get pregnant even if you’ve never missed a birth control pill.",
        "is_myth": False,
        "explanation": "Fact! No method is 100% effective — though the pill is over 90% effective with perfect use.",
        "age_group": "18+"
    },
    {
        "statement": "Douching after sex helps prevent pregnancy or STIs.",
        "is_myth": True,
        "explanation": "Myth! Douching does not prevent pregnancy or infections and can disrupt vaginal health.",
        "age_group": "18+"
    },
    {
        "statement": "People who are in monogamous relationships don’t need STI tests.",
        "is_myth": True,
        "explanation": "Myth! Even in monogamous relationships, STI testing is recommended unless both partners have been tested before becoming exclusive.",
        "age_group": "18+"
    },
    {
        "statement": "Pregnancy is possible even with 'just one time' unprotected sex.",
        "is_myth": False,
        "explanation": "Fact! It only takes one time for pregnancy to occur if no protection is used.",
        "age_group": "18+"
    },
    {
        "statement": "You can't get STIs if you’re using hormonal birth control.",
        "is_myth": True,
        "explanation": "Myth! Hormonal methods protect against pregnancy, not against STIs.",
        "age_group": "18+"
    },
    {
        "statement": "A person with an STI can still be a good partner.",
        "is_myth": False,
        "explanation": "Fact! With honesty, treatment, and protection, healthy relationships are possible.",
        "age_group": "18+"
    },
    {
        "statement": "It’s okay to delay testing for STIs if you don’t have symptoms.",
        "is_myth": True,
        "explanation": "Myth! Many STIs have no symptoms — regular testing is important if you're sexually active.",
        "age_group": "18+"
    },
    {
        "statement": "Using protection during sex is a shared responsibility.",
        "is_myth": False,
        "explanation": "Fact! Preventing pregnancy and STIs involves communication and mutual care.",
        "age_group": "18+"
    },
    {
        "statement": "You should get tested after each new sexual partner.",
        "is_myth": False,
        "explanation": "Fact! Testing helps protect you and your partner’s health.",
        "age_group": "18+"
    },
    {
        "statement": "The withdrawal method is highly effective at preventing pregnancy.",
        "is_myth": True,
        "explanation": "Myth! It's much less effective than condoms or hormonal methods.",
        "age_group": "18+"
    },
    {
        "statement": "You can’t get pregnant if you're breastfeeding.",
        "is_myth": True,
        "explanation": "Myth! Breastfeeding may reduce fertility but doesn’t guarantee you won’t get pregnant.",
        "age_group": "18+"
    },
    {
        "statement": "It's safe to rely only on emergency contraception regularly.",
        "is_myth": True,
        "explanation": "Myth! Emergency contraception is for occasional use and is not as effective as regular birth control.",
        "age_group": "18+"
    },
    {
        "statement": "Using condoms during oral sex lowers the risk of STI transmission.",
        "is_myth": False,
        "explanation": "Fact! Condoms and dental dams help protect during oral sex too.",
        "age_group": "18+"
    },
    {
        "statement": "HPV can lead to cancer in both men and women.",
        "is_myth": False,
        "explanation": "Fact! HPV can lead to cancers such as cervical, throat, and anal cancer.",
        "age_group": "18+"
    },
    {
        "statement": "If your STI test comes back negative, you never need to test again.",
        "is_myth": True,
        "explanation": "Myth! Regular testing is important if you're sexually active, especially with new or multiple partners.",
        "age_group": "18+"
    },
    {
        "statement": "STIs can affect your ability to have children in the future.",
        "is_myth": False,
        "explanation": "Fact! Untreated STIs can lead to infertility in both men and women.",
        "age_group": "18+"
    }
]




quiz_data_yoruba = [
    {
        "statement": "O ko le loyun ni igba akoko ti o ba ni ibalopọ.",
        "is_myth": True,
        "explanation": "Ìtàn ni! O le loyun nigbakugba ti o ba ni ibalopọ lai lo idaabobo — paapaa ni igba akọkọ.",
        "age_group": "14-17"
    },
    {
        "statement": "Kondomu daabobo mejeeji lodi si oyun ati awọn arun ibalopọ.",
        "is_myth": False,
        "explanation": "Otitọ ni! Nigbati a ba lo kondomu tọna, o dinku ewu oyun ati ọpọlọpọ STIs.",
        "age_group": "14-17"
    },
    {
        "statement": "Lilo kondomu meji ni igba kan maa n pese aabo meji.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Lilo kondomu meji le fa fifọ laarin wọn, eyi ti o le fa ki wọn bàjẹ́.",
        "age_group": "18+"
    },
    {
        "statement": "HIV le tan kaakiri nipasẹ kokoro jije.",
        "is_myth": True,
        "explanation": "Ìtàn ni! HIV ko le tan nipasẹ kokoro — o tan nipasẹ awọn omi ara pato nikan.",
        "age_group": "10-13"
    },
    {
        "statement": "Wíwẹ̀ tabi mimi lẹ́yìn ibalopọ le dena oyun.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Mimi tabi wíwẹ̀ lẹ́yìn ibalopọ ko le dena oyun.",
        "age_group": "14-17"
    },
    {
        "statement": "Àwọn ènìyàn àtẹ̀yìnwá nikan ni a le ní STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ẹnikẹ́ni tí ó bá ń ṣe ibalopọ le ní STI, koda pẹlu alabaṣepọ kan ṣoṣo.",
        "age_group": "14-17"
    },
    {
        "statement": "Pilu oyun le fa ki obinrin má le loyun mọ́.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Pilu oyun jẹ́ àfọ̀mọ́ra — ko fa ki obinrin má le loyun mọ́.",
        "age_group": "18+"
    },
    {
        "statement": "STI maa n fihan ami nigbagbogbo.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọ̀pọ̀ STI kìí ní àmi kankan. Ìdánwò deede ló jẹ́ àkọ́kọ́ láti mọ.",
        "age_group": "14-17"
    },
    {
        "statement": "O ko le ni STI ti iwọ ati alabaṣepọ rẹ jẹ́ wínrìn.",
        "is_myth": False,
        "explanation": "Otitọ ni! Bí ẹnikẹ́ni kò bá ti ní irú ibalopọ kankan, ewu STI jẹ́ kékèké gan-an.",
        "age_group": "14-17"
    },
    {
        "statement": "Ọna yíyọ lórí (withdrawal) jẹ́ ọna idena oyun tí ó dáa.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọna yíyọ lewu gan-an — pre-ejaculate le ni sperm.",
        "age_group": "14-17"
    },
    {
        "statement": "HPV le fa àkàn ẹ̀dọ-fún-fún (cervical cancer).",
        "is_myth": False,
        "explanation": "Otitọ ni! Diẹ ninu HPV le fa àkàn ẹ̀dọ-fún-fún — èyí ni kó ṣe pàtàkì lati gba abẹrẹ ajesara.",
        "age_group": "14-17"
    },
    {
        "statement": "O ko nilo idaabobo nigba ti o ba n ṣe ibalopọ ẹnu.",
        "is_myth": True,
        "explanation": "Ìtàn ni! STIs le tan nipasẹ ibalopọ ẹnu — idaabobo yẹ kí a lo.",
        "age_group": "18+"
    },
    {
        "statement": "Awọn ọkunrin ko le ni HPV.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Awọn ọkunrin le ni HPV àti jiyàn àìlera tó ní ibatan pẹ̀lú rẹ.",
        "age_group": "14-17"
    },
    {
        "statement": "Ìtọ́jú pajawiri le ṣiṣẹ́ lọ́jọ́ kejì lẹ́yìn ibalopọ nikan.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ìtọ́jú pajawiri le wúlò títí di ọjọ́ kẹta tàbí karun.",
        "age_group": "18+"
    },
    {
        "statement": "Obinrin ko le loyun nigba ti o ba wa l’akoko (period).",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ó ṣòro, ṣùgbọ́n ó ṣeeṣe — sperm le wà lára obìnrin fún ọ̀pọ̀ ọjọ́.",
        "age_group": "14-17"
    },
    {
        "statement": "O le mọ̀ pé ẹnikan ní STI nipa fífi ojú wo wọn.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọ̀pọ̀ STI kò ní àmi tí a lè rí — àyẹ̀wò ni ọ̀nà tó dájú.",
        "age_group": "14-17"
    },
    {
        "statement": "Kondomu le pari ọjọ́ rẹ̀ — kí o fi silẹ lẹ́yìn ọjọ́ tó wúlò.",
        "is_myth": False,
        "explanation": "Otitọ ni! Kondomu tó parí le fọ — ṣáyẹ̀wò ọjọ́ tó lórí rẹ.",
        "age_group": "14-17"
    },
    {
        "statement": "Ìwẹ̀wẹ̀ (douching) lẹ́yìn ibalopọ daabobo lodi sí STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ìwẹ̀wẹ̀ ko daabobo STI — ó le dá ààyè ìbálẹ̀ obìnrin lóró.",
        "age_group": "18+"
    },
    {
        "statement": "Pilu pajawiri jẹ́ ìṣẹ̀dá oyún (abortion).",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ẹ̀rọ oyún pajawiri n ṣe idiwọ oyun, kò pa oyún run.",
        "age_group": "18+"
    },
    {
        "statement": "HIV le tan kaakiri nipa pípa brọshu ẹnu pọ tàbí tọọwẹlì.",
        "is_myth": True,
        "explanation": "Ìtàn ni! HIV ko tan kaakiri nípa fífi ohun wọpọ lo — o tan nípa omi ara kan ṣoṣo.",
        "age_group": "10-13"
    },
    {
        "statement": "Lilo pilu oyun daabobo lodi sí STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Pilu oyun n dènà oyun nikan — kò daabobo lodi sí STI.",
        "age_group": "14-17"
    },
    {
        "statement": "O ko le ní STI látọ̀run ijoko balùwẹ̀.",
        "is_myth": False,
        "explanation": "Otitọ ni! STI ko le yè lórí ojú ilẹ̀ — kò tan kaakiri nípa ijoko balùwẹ̀.",
        "age_group": "14-17"
    },
    {
        "statement": "Gbigba pilu oyun maa n fa ki gbogbo obinrin gbàra.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Kò jẹ́ pé gbogbo obinrin ni ipa tó yàtọ̀ — ipa rẹ da lori ara ẹni ati irú pilu.",
        "age_group": "18+"
    },
    {
        "statement": "Kí àwọn tí kò ní alabaṣepọ púpò̀ nikan ló nílò ayẹwo STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ẹnikẹ́ni tí ó bá ń ṣe ibalopọ yẹ kí o ma ṣe ayẹwo STI lọ́pọ̀lọpọ̀.",
        "age_group": "18+"
    },
    {
        "statement": "STI le ni ipa lórí agbára lati loyun.",
        "is_myth": False,
        "explanation": "Otitọ ni! STIs tí kò bá gba ìtọ́jú le fa iṣoro loyun.",
        "age_group": "18+"
    },
    {
        "statement": "O ko le ní HIV tí iwọ àti alabaṣepọ rẹ dájú pé ara wọn dáa.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọ̀pọ̀ èèyàn tí ó ní HIV kò ní àmi — ayẹwo nikan ló lè jẹ́ kedere.",
        "age_group": "14-17"
    },
    {
        "statement": "Obinrin nikan ni o yẹ kí o ròyìn oyun.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ìdènà oyun àti STI jẹ́ ojuse pẹ̀lú mejeeji.",
        "age_group": "14-17"
    },
    {
        "statement": "STI jẹ́ kékèké jùlọ fún àwọn ọkùnrin.",
        "is_myth": True,
        "explanation": "Ìtàn ni! STI le fa àìlera tó lewu fún gbogbo ènìyàn tí kò bá gba ìtọ́jú.",
        "age_group": "14-17"
    },
    {
        "statement": "O le loyun koda tí o jẹ́ igba akọkọ rẹ.",
        "is_myth": False,
        "explanation": "Otitọ ni! O le loyun nigbakugba ti o ba ṣe ibalopọ lai lo idaabobo — paapaa igba akọkọ.",
        "age_group": "14-17"
    },
    {
        "statement": "O yẹ kí o ṣàbẹwò dókítà lẹsẹkẹsẹ tí o bá rò pé o ní STI.",
        "is_myth": False,
        "explanation": "Otitọ ni! Ìtọ́jú tete le dènà iṣoro àtẹ̀yìnwá àti títan sáwọn míì.",
        "age_group": "18+"
    },
    {
        "statement": "Sísọ̀rọ̀ nípa ibalopọ máa n bà ìmúra jẹ́.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ìbànújẹ̀ sísọ̀tọ̀ n dá ìgbẹ́kẹ̀lé sílẹ̀, ààbò àti ìrírí ibalopọ tó dáa.",
        "age_group": "18+"
    },
    {
        "statement": "O le ní STI koda ní igba akọkọ ti o bá ni ibalopọ.",
        "is_myth": False,
        "explanation": "Otitọ ni! STI le tan nigbakugba ti ibalopọ ba waye lai idaabobo, paapaa igba akọkọ.",
        "age_group": "10-13"
    },
    {
        "statement": "O ko le loyun tí ó bá jẹ́ igba akọkọ rẹ.",
        "is_myth": True,
        "explanation": "Ìtàn ni! O le loyun nigbakugba tí ibalopọ ba waye lai idaabobo — paapaa igba akọkọ.",
        "age_group": "10-13"
    },
    {
        "statement": "O le mọ̀ pé ẹnikan ní STI nipa fífi ojú wo wọn.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọ̀pọ̀ STI kò ní àmi — ayẹwo nikan ló le jẹ́ gidi.",
        "age_group": "10-13"
    },
    {
        "statement": "HIV le tan kaakiri nípa ẹ̀jẹ̀.",
        "is_myth": False,
        "explanation": "Otitọ ni! HIV le tan nípa ẹ̀jẹ̀, omi sẹ́mìnì, omi ibálẹ̀ obìnrin àti wara ọmú.",
        "age_group": "10-13"
    },
    {
        "statement": "O ko le ní HIV láti fi ara mọ́, jẹun pọ̀ tàbí lo balùwẹ̀ kan naa.",
        "is_myth": False,
        "explanation": "Otitọ ni! HIV kìí tan kaakiri nípa fífi ara mọ́ tàbí lo ohun kan pọ̀ — o tan nípa omi ara kan ṣoṣo.",
        "age_group": "10-13"
    },
    {
        "statement": "Awon obinrin ko le loyun nigba akoko won.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ó ṣòro, ṣùgbọ́n ó ṣeeṣe — sperm le wà lára obìnrin fún ọjọ́ mélòó kan.",
        "age_group": "10-13"
    },
    {
        "statement": "Awon obinrin nikan ni o nilo lati ko eko nipa STI ati oyun.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Gbogbo ènìyàn yẹ kí wọn mọ bí oyun ati STI ṣe n ṣẹlẹ̀ àti bí a ṣe le dá wọn dúró.",
        "age_group": "10-13"
    },
    {
        "statement": "O le ní STI lati inu ibalopọ ẹnu.",
        "is_myth": False,
        "explanation": "Otitọ ni! STIs le tan ní gbogbo irú ibalopọ tí kò bá ní idaabobo.",
        "age_group": "10-13"
    },
    {
        "statement": "O ko le loyun nipa fífi ẹnu kọ́ tàbí fi ọwọ́ kan.",
        "is_myth": False,
        "explanation": "Otitọ ni! Oyun ṣẹlẹ̀ nípa ibalopọ obìnrin ati ọkùnrin — kìí ṣẹlẹ̀ nipa fífi ọwọ́ tàbí ẹnu.",
        "age_group": "10-13"
    },
    {
        "statement": "STI ṣẹlẹ̀ sí ẹni tí kò ba wẹ tàbí mọ́ ara mọ́.",
        "is_myth": True,
        "explanation": "Ìtàn ni! STI tan kaakiri nípa ibalopọ — kìí jẹ́ pé ẹni naa kò mọ́ ara rẹ mọ́.",
        "age_group": "10-13"
    },
    {
        "statement": "Kondomu le daabobo lodi si oyun ati STIs.",
        "is_myth": False,
        "explanation": "Otitọ ni! Nígbà tí a bá lo kondomu tọna, o ṣe iranlọwọ lati dènà oyun ati ọpọlọpọ STIs.",
        "age_group": "10-13"
    },
    {
        "statement": "Àwọn agbalagba nikan ló le ní STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ẹnikẹ́ni tí ó bá ní ibalopọ le ní STI, paapáà jùlọ àwọn ọdọ.",
        "age_group": "10-13"
    },
    {
        "statement": "O ko le ní STI ti ẹyọ méjèèjì jẹ́ wínrìn.",
        "is_myth": False,
        "explanation": "Otitọ ni! Bí ẹnikẹ́ni kò bá ti ní ibalopọ kankan, ewu STI kere pupọ.",
        "age_group": "10-13"
    },
    {
        "statement": "A wa ajesara tó le dènà diẹ ninu STI.",
        "is_myth": False,
        "explanation": "Otitọ ni! Ajesara HPV le daabobo lodi sí diẹ ninu àkàn tó jẹ́ abajade HPV.",
        "age_group": "10-13"
    },
    {
        "statement": "O le ní HIV nipasẹ kokoro jije.",
        "is_myth": True,
        "explanation": "Ìtàn ni! HIV ko tan kaakiri nipasẹ kokoro jije — o tan nipa omi ara kan ṣoṣo.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs maa n fihan àmi bí itching tàbí omi tí ń jáde.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọ̀pọ̀ STI kìí ní àmi — Ìdánwò ni ọ̀nà tó dájú.",
        "age_group": "10-13"
    },
    {
        "statement": "Lilo kondomu méjì lẹ́kan ṣoṣo n fun ni aabo tó pọ̀.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Lilo kondomu méjì le fa ki wọn fọ́ nitori íja laarin wọn.",
        "age_group": "10-13"
    },
    {
        "statement": "Àwọn ènìyàn tó ní HIV le wà láradá pẹ̀lú ìtọ́jú.",
        "is_myth": False,
        "explanation": "Otitọ ni! Pẹ̀lú ìtọ́jú to peye, wọ́n le wà láyọ̀ pẹ̀lú ilera tó dáa.",
        "age_group": "10-13"
    },
    {
        "statement": "Àwọn tí ó ní alabaṣepọ púpọ̀ nikan ló ní STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ẹnikẹ́ni tí ó bá ní ibalopọ le ní STI, paapáà pẹ̀lú alabaṣepọ kan ṣoṣo.",
        "age_group": "10-13"
    },
    {
        "statement": "Wíwẹ̀ lẹ́yìn ibalopọ le dènà oyun.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Wíwẹ̀ kìí ṣe idena oyun tàbí STI — idaabobo ló dájú.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs le jẹ̀wọ̀ kí a fi antibiotics to tọ́jú wọn.",
        "is_myth": False,
        "explanation": "Otitọ ni! Diẹ ninu STIs bíi chlamydia àti gonorrhea le jẹ̀wọ̀ pẹ̀lú antibiotics.",
        "age_group": "10-13"
    },
    {
        "statement": "A le ní STI láti ijoko balùwẹ̀.",
        "is_myth": True,
        "explanation": "Ìtàn ni! STIs kìí yè lórí ojú ilẹ̀ — wọn kò tan kaakiri nípa ijoko balùwẹ̀.",
        "age_group": "10-13"
    },
    {
        "statement": "Ó ṣe pàtàkì láti bá agà tí a gbẹ́kẹ̀ lé sọrọ nípa ibalopọ, STIs tàbí oyun.",
        "is_myth": False,
        "explanation": "Otitọ ni! Agà tí o gbẹ́kẹ̀ lé le fun ọ ní ìmọ̀ tó tọ́.",
        "age_group": "10-13"
    },
    {
        "statement": "O le loyun koda tí ọkùnrin naa kò ba fi gbogbo sperm rẹ̀ sílẹ̀.",
        "is_myth": False,
        "explanation": "Otitọ ni! Pre-ejaculate le ni sperm — o ṣeeṣe lati loyun.",
        "age_group": "10-13"
    },
    {
        "statement": "Pilu oyun le daabobo lodi sí STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Pilu oyun daabobo lodi sí oyun nikan — ko ṣiṣẹ́ lodi sí STIs.",
        "age_group": "10-13"
    },
    {
        "statement": "Ẹnikẹ́ni tí ó ní STI maa n mọ̀ pé ó ní i.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọ̀pọ̀ ènìyàn kìí mọ pé wọ́n ní STI ayafi tí wọ́n bá ṣe ayẹwo.",
        "age_group": "10-13"
    },
    {
        "statement": "Ọna kan ṣoṣo tó dájú láti dènà STI àti oyun ni kìí ṣe ibalopọ.",
        "is_myth": False,
        "explanation": "Otitọ ni! Kí o má ṣe ibalopọ rárá ni ọna kan ṣoṣo tí ko ní ewu.",
        "age_group": "10-13"
    },
    {
        "statement": "O le ní STI nipa pípa kọ̀pà pọ̀.",
        "is_myth": True,
        "explanation": "Ìtàn ni! STIs kìí tan kaakiri nípa pípa kọ̀pà pọ̀ — wọn tan nipasẹ ibalopọ.",
        "age_group": "10-13"
    },
    {
        "statement": "Àwọn agbalagba nikan ni o yẹ kí wọn ṣe ayẹwo STI.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ẹnikẹ́ni tí ó bá ní ibalopọ yẹ kí ó ṣe ayẹwo, kí ó tó pé ọjọ-ori agbalagba.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs le ba ìṣẹ́ oyún lóró ní ọjọ iwájú.",
        "is_myth": False,
        "explanation": "Otitọ ni! STIs tí kò bá gba ìtọ́jú le fa àìlera oyún ní ọjọ iwájú.",
        "age_group": "10-13"
    },
    {
        "statement": "O le loyun koda tí alabaṣepọ rẹ ba yọ́ ṣáájú ki o to yọ̀.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Pre-ejaculate le ni sperm, ọna yíyọ̀ kìí jẹ́ ìtójú tó dájú.",
        "age_group": "18+"
    },
    {
        "statement": "Àwọn ọna pilu oyun kò daabobo lodi sí STI.",
        "is_myth": False,
        "explanation": "Otitọ ni! Pilu oyun daabobo lodi sí oyun nikan — kondomu ni a nilo fún STI.",
        "age_group": "18+"
    },
    {
        "statement": "O ko le ní STI látọ̀run ẹni tó ń dáa.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ọ̀pọ̀ ènìyàn tí ó ní STI kìí ní àmi kankan — ayẹwo nikan ló dájú.",
        "age_group": "18+"
    },
    {
        "statement": "HPV jẹ́ STI tó wọpọ̀ jùlọ, ó sì le kan gbogbo akọ àti abo.",
        "is_myth": False,
        "explanation": "Otitọ ni! HPV wọpọ gan-an — ó le kan akọ àti abo.",
        "age_group": "18+"
    },
    {
        "statement": "Lilo kondomu tọna gbogbo igba dinku ewu STI ati oyun.",
        "is_myth": False,
        "explanation": "Otitọ ni! Kondomu jẹ́ gíga munadoko tí a bá lo tọna.",
        "age_group": "18+"
    },
    {
        "statement": "Ìtọ́jú pajawiri jẹ́ àbòyún (abortion).",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ìtọ́jú pajawiri n dènà oyun — kò pa oyun run.",
        "age_group": "18+"
    },
    {
        "statement": "Ọ̀pọ̀ STI le jẹ̀wọ̀ pẹ̀lú ìtọ́jú.",
        "is_myth": False,
        "explanation": "Otitọ ni! Ọ̀pọ̀ STI bí chlamydia àti gonorrhea le jẹ̀wọ̀, àwọn mìíràn bí herpes tàbí HIV le jẹ́ àgbéyẹ̀wò.",
        "age_group": "18+"
    },
    {
        "statement": "O ko nilo ayẹwo STI tí o bá wà nínú ibasepọ pípẹ́.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Ayẹwo ṣi jẹ́ pàtàkì, pàápàá tí ẹnikẹ́ni kò bá ti ṣe ayẹwo ṣáájú ibasepọ.",
        "age_group": "18+"
    },
    {
        "statement": "O le ní STI lati ibalopọ ẹnu tàbí ìdí.",
        "is_myth": False,
        "explanation": "Otitọ ni! STIs le tan kaakiri ní gbogbo irú ibalopọ tí kò ní idaabobo.",
        "age_group": "18+"
    },
    {
        "statement": "Ìjẹ̀wọ̀ pé ìwọ àti alabaṣepọ rẹ ti ṣe ayẹwo STI ṣáájú ibalopọ le din ewu rẹ kù.",
        "is_myth": False,
        "explanation": "Otitọ ni! Ìbánisọ̀rọ̀ àti ayẹwo ṣáájú ibalopọ jẹ́ apá pàtàkì fún aabo ilera ibalopọ.",
        "age_group": "18+"
    },
    {
        "statement": "Kondomu kìí fọ bí o bá lo wọn tọna.",
        "is_myth": False,
        "explanation": "Otitọ ni! Nígbà tí a bá lo kondomu tọna, ewu fọ wọn kere gan-an.",
        "age_group": "18+"
    },
    {
        "statement": "Ìmúlójú oyún (pregnancy) le ṣẹlẹ̀ ẹ̀kúnrẹ́rẹ́ lẹ́yìn ibalopọ àkọ́kọ́.",
        "is_myth": False,
        "explanation": "Otitọ ni! Ẹnikẹ́ni tó ní ibalopọ obìnrin àti ọkùnrin le loyun, koda lẹ́kọ̀ọ́kan ṣoṣo.",
        "age_group": "18+"
    },
    {
        "statement": "Bí obìnrin bá ń mu oyun, kò le ní STI tuntun.",
        "is_myth": True,
        "explanation": "Ìtàn ni! Oyun kò dá obìnrin dúró láti ní STI — idaabobo ṣi wulo.",
        "age_group": "18+"
    },
    {
        "statement": "Kí ẹni ṣàì ní àìlera, kò túmọ̀ sí pé kò ní HIV.",
        "is_myth": False,
        "explanation": "Otitọ ni! Ọ̀pọ̀ ènìyàn tí ó ní HIV kìí ní àmi kankan fún ọdún púpọ̀ — ayẹwo nikan ni ó dájú.",
        "age_group": "18+"
    }
]





quiz_data_pidgin = [
    {
        "statement": "You no fit get belle the first time wey you do sex.",
        "is_myth": True,
        "explanation": "Na lie! Anytime you do unprotected sex, even if na your first time, you fit still get belle.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Condom dey protect against belle and STIs.",
        "is_myth": False,
        "explanation": "Na true! If you use condom well, e go reduce the chance make person get belle or contract STIs.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "If you use two condom together, na double protection be that.",
        "is_myth": True,
        "explanation": "Na lie! Two condom fit rub each other and tear, wey go make e less safe.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "Mosquito fit give person HIV.",
        "is_myth": True,
        "explanation": "Na lie! HIV no dey spread through mosquito bite. Na through certain body fluid e dey spread.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "If you baff or piss after sex, you no go get belle.",
        "is_myth": True,
        "explanation": "Na lie! To baff or piss after sex no dey stop belle.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Na only people wey dey sleep around dey get STIs.",
        "is_myth": True,
        "explanation": "Na lie! Anybody wey dey do sex fit get STI, no matter how many partner dem get.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Birth control pills dey make woman no fit born again.",
        "is_myth": True,
        "explanation": "Na lie! Pills no dey cause permanent wahala. If person stop am, dem fit still born.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "STIs always dey show sign.",
        "is_myth": True,
        "explanation": "Na lie! Plenty STIs no dey show any sign. Na why testing dey important.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "If you and your partner na virgin, you no fit get STI.",
        "is_myth": False,
        "explanation": "Na true! If una never do any sexual thing before, the chance to get STI low well well.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Withdrawal (pull-out method) na sure way to prevent belle.",
        "is_myth": True,
        "explanation": "Na lie! Pre-cum fit still get sperm. E no sure like condom or other methods.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "HPV fit cause cervical cancer.",
        "is_myth": False,
        "explanation": "Na true! Some type of HPV dey cause cervical cancer. Na why HPV vaccine dey important.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "You no need use condom for oral sex.",
        "is_myth": True,
        "explanation": "Na lie! STI fit still enter through oral sex. Condom or dental dam still dey help.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "Men no fit get HPV.",
        "is_myth": True,
        "explanation": "Na lie! Men fit get HPV and e fit still cause wahala for their body.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Emergency contraception dey work only the next day after sex.",
        "is_myth": True,
        "explanation": "Na lie! E fit still work for 3–5 days after the sex, depending on the type.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "Girl no fit get belle if she dey her period.",
        "is_myth": True,
        "explanation": "Na lie! E rare, but e fit happen because sperm fit survive for days inside body.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "You fit know person get STI just by looking them.",
        "is_myth": True,
        "explanation": "Na lie! Most STIs no dey show for body. Testing na the only sure way.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Expired condom no good to use.",
        "is_myth": False,
        "explanation": "Na true! If condom don expire, e fit tear. Always check date before you use am.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "To douche after sex go stop STIs.",
        "is_myth": True,
        "explanation": "Na lie! Douching no dey protect person and fit even disturb the vagina.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "Morning-after pill and abortion na the same thing.",
        "is_myth": True,
        "explanation": "Na lie! Morning-after pill dey stop belle from happen — e no dey end belle wey don start.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "If person look healthy, dem no fit get HIV.",
        "is_myth": True,
        "explanation": "Na lie! Person fit get HIV and still look fine. Only test go show true result.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Pills dey protect against STIs.",
        "is_myth": True,
        "explanation": "Na lie! Pills dey stop belle but dem no dey protect from STIs.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Toilet seat no fit give person STI.",
        "is_myth": False,
        "explanation": "Na true! STIs no dey live long for surface like toilet seat. Dem no dey spread like that.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Birth control dey make everybody fat.",
        "is_myth": True,
        "explanation": "Na lie! E no happen to everybody — e depend on person and the kind control wey dem use.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "Na only people wey sleep around need STI test.",
        "is_myth": True,
        "explanation": "Na lie! Anybody wey dey do sex suppose dey test, no matter how many partner dem get.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "STIs fit affect person fertility.",
        "is_myth": False,
        "explanation": "Na true! If person no treat STI like chlamydia or gonorrhea, e fit spoil chance to born later.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "If two partners look healthy, dem no fit get HIV.",
        "is_myth": True,
        "explanation": "Na lie! HIV no dey always show sign. Test na the only sure way to sabi.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Na only woman suppose worry about pregnancy control.",
        "is_myth": True,
        "explanation": "Na lie! Na both man and woman get responsibility to stop belle and STI.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "STIs no too serious for men reach women.",
        "is_myth": True,
        "explanation": "Na lie! STIs fit harm anybody if dem no treat am, whether man or woman.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "You fit get belle even if na your first time do sex.",
        "is_myth": False,
        "explanation": "Na true! Any time wey you do unprotected sex, you fit get belle.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "If you feel say you get STI, make you go hospital sharp sharp.",
        "is_myth": False,
        "explanation": "Na true! Early treatment dey stop big wahala and make you no pass am give person.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "To talk about sex with your partner go spoil the mood.",
        "is_myth": True,
        "explanation": "Na lie! To talk well with your partner go make una trust each other and enjoy the sex more.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "You fit get STI the first time wey you do sex.",
        "is_myth": False,
        "explanation": "Na true! STI fit enter from the very first time wey person do unprotected sex.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "You no fit get belle if na your first time wey you do sex.",
        "is_myth": True,
        "explanation": "Na lie! Belle fit happen anytime wey you do unprotected sex, even the first time.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "You fit know person get STI just by looking them.",
        "is_myth": True,
        "explanation": "Na lie! Many STIs no dey show for body. Na only test go show.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "HIV fit spread through blood.",
        "is_myth": False,
        "explanation": "Na true! HIV dey spread through blood, semen, vaginal fluid and breast milk.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "You no fit get HIV from hugging, share food or use same toilet.",
        "is_myth": False,
        "explanation": "Na true! HIV no dey spread through casual contact like that.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Girls no fit get belle during their period.",
        "is_myth": True,
        "explanation": "Na lie! E rare but e fit happen because sperm fit still dey body for some days.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Na only girls suppose learn about STI and pregnancy.",
        "is_myth": True,
        "explanation": "Na lie! Everybody suppose sabi how STI and pregnancy dey happen and how to prevent am.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "You fit get STI from oral sex.",
        "is_myth": False,
        "explanation": "Na true! STI fit enter from any kind unprotected sex, even oral.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "You no fit get belle from kissing or holding hands.",
        "is_myth": False,
        "explanation": "Na true! Na only sex fit make person get belle — not touching or kissing.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Na dirty people dey get STI.",
        "is_myth": True,
        "explanation": "Na lie! STI dey spread through sex — no be because person no dey clean.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Condom dey help protect from belle and STI.",
        "is_myth": False,
        "explanation": "Na true! If you use condom well, e go protect you from plenty wahala.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Na only adults fit get STI.",
        "is_myth": True,
        "explanation": "Na lie! Anybody wey dey sexually active fit get STI, no matter age.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "If both partners be virgin, dem no fit get STI.",
        "is_myth": False,
        "explanation": "Na true! If both of una never do any sexual thing before, risk dey low.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Vaccine dey to prevent some STI.",
        "is_myth": False,
        "explanation": "Na true! HPV vaccine dey help protect against some cancer wey STI dey cause.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "HIV fit spread through mosquito bite.",
        "is_myth": True,
        "explanation": "Na lie! HIV no dey spread by mosquito — na only certain fluid fit carry am.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "STI always dey show sign like itching or discharge.",
        "is_myth": True,
        "explanation": "Na lie! Some STI no dey show any sign. Testing dey important.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "To use two condoms at once dey protect you more.",
        "is_myth": True,
        "explanation": "Na lie! The friction go make dem tear. Use one well-correct condom instead.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "If person get HIV, dem fit still live long life if dem get treatment.",
        "is_myth": False,
        "explanation": "Na true! With medicine, people fit live long, healthy life even with HIV.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Na only people wey get plenty partner dey get STI.",
        "is_myth": True,
        "explanation": "Na lie! Even one partner fit give you STI if dem get am.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "To baff after sex go stop belle.",
        "is_myth": True,
        "explanation": "Na lie! Baffing no dey stop belle or STI — na condom or protection go help.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Some STI fit cure with antibiotic.",
        "is_myth": False,
        "explanation": "Na true! STI like chlamydia fit cure, but some like HIV no get cure.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Toilet seat fit pass STI.",
        "is_myth": True,
        "explanation": "Na lie! STI no dey survive for surface like that — no dey fear toilet seat.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "If you confuse about sex, make you talk to trusted adult.",
        "is_myth": False,
        "explanation": "Na true! Trusted adult go give you correct info and guide you.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "If sperm near vagina, person fit still get belle.",
        "is_myth": False,
        "explanation": "Na true! Even if penis no enter fully, sperm fit still cause belle.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "Birth control pills dey protect against STI.",
        "is_myth": True,
        "explanation": "Na lie! Pills dey stop belle only — dem no dey stop STI.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "People wey get STI always sabi say dem get am.",
        "is_myth": True,
        "explanation": "Na lie! Plenty people no dey show sign. Testing na the only way to know.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "The only sure way to avoid STI and belle na to no do sex at all.",
        "is_myth": False,
        "explanation": "Na true! If you no do sex, you no fit get belle or catch STI.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "You fit get STI if you share drink with person.",
        "is_myth": True,
        "explanation": "Na lie! STI no dey pass through cups or drink — na through sex or fluid.",
        "age_group": "10-13",
        "language": "Pidgin"
    },
    {
        "statement": "To test for STI go make people think say you dey do anyhow.",
        "is_myth": True,
        "explanation": "Na lie! To do STI test show say you dey responsible for your health.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Even if you no get symptom, you fit still get STI.",
        "is_myth": False,
        "explanation": "Na true! STI fit dey body without any sign. Na why regular testing dey important.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Once person don get STI before, dem no fit get am again.",
        "is_myth": True,
        "explanation": "Na lie! Some STI fit come back if person expose again.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Condom dey expire.",
        "is_myth": False,
        "explanation": "Na true! If condom don expire, e fit tear. Always check the expiry date.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "To urinate after sex go prevent STI.",
        "is_myth": True,
        "explanation": "Na lie! E fit help reduce UTI but e no go stop STI.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "HIV treatment fit make person no pass the virus give others.",
        "is_myth": False,
        "explanation": "Na true! If person dey take HIV meds well, dem no go fit pass am give another.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "Only gay people dey get HIV.",
        "is_myth": True,
        "explanation": "Na lie! Anybody fit get HIV, no matter who dem dey sleep with.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "STI dey always cause pain or itching.",
        "is_myth": True,
        "explanation": "Na lie! Many people no dey feel anything even if dem get STI.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Condom no dey 100% perfect, but e still better than nothing.",
        "is_myth": False,
        "explanation": "Na true! E no dey perfect but e reduce risk well well if you use am correct.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "If you trust your partner, you no need use condom.",
        "is_myth": True,
        "explanation": "Na lie! Even trust no dey stop infection. Talk openly and still use protection.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "STI fit make woman no fit get belle later.",
        "is_myth": False,
        "explanation": "Na true! If STI no get treatment, e fit block chance to born.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "You go always know if condom tear during sex.",
        "is_myth": True,
        "explanation": "Na lie! Sometimes you no go know. Always check am before and after.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Once you don get STI, nobody go want date you again.",
        "is_myth": True,
        "explanation": "Na lie! With treatment and honesty, healthy relationship still dey possible.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Boys no suppose worry about get belle.",
        "is_myth": True,
        "explanation": "Na lie! Boys suppose help prevent belle too — e concern both people.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "If you no feel sick, you no need HIV test.",
        "is_myth": True,
        "explanation": "Na lie! HIV fit dey body for long without sign. Test na the only way to know.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "If condom enter body, you no fit bring am out yourself.",
        "is_myth": True,
        "explanation": "Na lie! Sometimes you fit try remove am, but if you no fit, go hospital sharp.",
        "age_group": "18+",
        "language": "Pidgin"
    },
    {
        "statement": "To talk about sex or STI dey shameful.",
        "is_myth": True,
        "explanation": "Na lie! To talk about your health dey brave and smart.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "HPV dey cause genital warts and cancer.",
        "is_myth": False,
        "explanation": "Na true! HPV fit cause both. HPV vaccine dey help prevent am.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "You no fit get STI if you do sex inside water.",
        "is_myth": True,
        "explanation": "Na lie! Sex inside water no dey stop STI or belle. Still use protection.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "To check your STI status na part of good relationship.",
        "is_myth": False,
        "explanation": "Na true! E show say you care for yourself and your partner.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "Once you use condom, you no need any other protection.",
        "is_myth": True,
        "explanation": "Na lie! Condom good, but to combine with other method fit give extra safety.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "People wey no dey do sex no need learn about STI or pregnancy.",
        "is_myth": True,
        "explanation": "Na lie! Knowledge dey important, even if you never start sex.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "To carry condom no mean say you bad.",
        "is_myth": False,
        "explanation": "Na true! E mean say you wise and you dey take care of yourself.",
        "age_group": "14-17",
        "language": "Pidgin"
    },
    {
        "statement": "If you no talk about STI, e no go happen.",
        "is_myth": True,
        "explanation": "Na lie! To talk about am dey help you plan and protect yourself.",
        "age_group": "14-17",
        "language": "Pidgin"
    }
]





quiz_data_igbo = [
    {
        "statement": "Ị gaghị enwe ime n’oge mbụ i meere mmekọahụ.",
        "is_myth": True,
        "explanation": "Nke a bụ ụgha! Ị nwere ike inwe ime oge ọ bụla i meere mmekọahụ na-enweghị nchekwa — ọbụna nke mbụ.",
        "age_group": "14-17"
    },
    {
        "statement": "Kondom na-echebe megide ime na STIs abụọ.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na eji ya nke ọma, kondom na-ebelata ihe ize ndụ ime na ọtụtụ STIs.",
        "age_group": "14-17"
    },
    {
        "statement": "Ịsị kondom abụọ na-enye nchebe ugboro abụọ.",
        "is_myth": True,
        "explanation": "Ụgha! Ịsị kondom abụọ nwere ike ime ka ha kụsie ibe ha, meekwa ka otu n’ime ha gbajie.",
        "age_group": "18+"
    },
    {
        "statement": "A pụkwara ibuga HIV site n’ịtụ ya n’ọnyà mmị ọkụ.",
        "is_myth": True,
        "explanation": "Ụgha! HIV anaghị ebu site n’ọnyà mmị ọkụ — ọ na-ebufe site n’ime mmụọ ụfọdụ n’ahụ mmadụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịsa ahụ ma ọ bụ ime mkpọtụ mgbe e mechara mmekọahụ nwere ike gbochie ime.",
        "is_myth": True,
        "explanation": "Ụgha! Ịsa ahụ ma ọ bụ ime mkpọtụ agaghị egbochi ime.",
        "age_group": "14-17"
    },
    {
        "statement": "Naanị ndị na-agba afọ n’ụlọ ka na-enweta STIs.",
        "is_myth": True,
        "explanation": "Ụgha! Onye ọ bụla na-eme mmekọahụ nwere ike inweta STI, ọbụlagodi na ha nwere otu onye.",
        "age_group": "14-17"
    },
    {
        "statement": "Ịṅa ọgwụ mgbochi ime nwere ike ime ka nwanyị ghara inwe nwa ọzọ.",
        "is_myth": True,
        "explanation": "Ụgha! Ọgwụ mgbochi ime nwere ike ịkwụsị iji na-enweghị mmetụta mgbe e mesịrị.",
        "age_group": "18+"
    },
    {
        "statement": "STIs na-egosi ihe mgbaàmà mgbe niile.",
        "is_myth": True,
        "explanation": "Ụgha! Ọtụtụ STIs anaghị egosi ihe mgbaàmà. Ọ bụ ya mere o ji dị mkpa iji nwalee mgbe niile.",
        "age_group": "14-17"
    },
    {
        "statement": "Ị gaghị enweta STI ma ọ bụrụ na gị na onye ibe gị bụ ụmụaka na-adịghị eme ihe.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na mmadụ abụọ emeghị mmekọahụ, ihe ize ndụ STI dị ezigbo ala.",
        "age_group": "14-17"
    },
    {
        "statement": "Ụzọ ịpụ n'oge (withdrawal) bụ usoro a pụrụ ịdabere na ya iji gbochie ime.",
        "is_myth": True,
        "explanation": "Ụgha! Ụzọ a dị ize ndụ n’ihi na mmiri mbụ nwere ike ịnwe sperm.",
        "age_group": "14-17"
    },
    {
        "statement": "HPV nwere ike iduga cancer nke ime ụmụ nwanyị.",
        "is_myth": False,
        "explanation": "Eziokwu! Ụdị HPV ụfọdụ na-akpata cancer ime — nke mere eji eji ọgwụ mgbochi.",
        "age_group": "14-17"
    },
    {
        "statement": "Ị chọghị nchekwa n’oge oral sex.",
        "is_myth": True,
        "explanation": "Ụgha! A pụkwara ibuga STIs site na oral sex — ọ dị mkpa iji nchekwa.",
        "age_group": "18+"
    },
    {
        "statement": "Ụmụ nwoke enweghị ike inweta HPV.",
        "is_myth": True,
        "explanation": "Ụgha! Ụmụ nwoke nwekwara ike inweta HPV ma nwee nsogbu ahụ ike si na ya.",
        "age_group": "14-17"
    },
    {
        "statement": "Ụgwọ mberede a na-enye mgbe e mesịrị nwere ike rụọ ọrụ naanị otu ụbọchị.",
        "is_myth": True,
        "explanation": "Ụgha! Ụgwọ mberede a nwere ike ịrụ ọrụ ruo ụbọchị atọ ruo ise.",
        "age_group": "18+"
    },
    {
        "statement": "Nwanyị agaghị enwe ime n’oge ọ na-enwe menses.",
        "is_myth": True,
        "explanation": "Ụgha! Ọ bụrụgodị na ọ na-adịghị ahụ menses, sperm nwere ike ịnọ n’ime ahụ ruo ọtụtụ ụbọchị.",
        "age_group": "14-17"
    },
    {
        "statement": "Ị nwere ike ịmata ma mmadụ nwere STI site n’ile ya.",
        "is_myth": True,
        "explanation": "Ụgha! Ọtụtụ STIs anaghị egosi ihe mgbaàmà — nwalee bụ ụzọ kachasị mma.",
        "age_group": "14-17"
    },
    {
        "statement": "Kondom nwere ụbọchị ngwụcha — echekwala ya mgbe ọ gafere.",
        "is_myth": False,
        "explanation": "Eziokwu! Mgbe kondom gafere ụbọchị ngwụcha, ọ nwere ike ịgbajikwa — jide n’aka na ị na-enyocha ụbọchị.",
        "age_group": "14-17"
    },
    {
        "statement": "Ịsa ime nwaanyị (douching) mgbe e mechara mmekọahụ nwere ike gbochie STIs.",
        "is_myth": True,
        "explanation": "Ụgha! Douching anaghị egbochi STIs ma nwekwara ike imebi akpụkpọ ahụ.",
        "age_group": "18+"
    },
    {
        "statement": "Ụgwọ mberede a bụ otu ihe na ime ụmụaka.",
        "is_myth": True,
        "explanation": "Ụgha! Ụgwọ mberede a na-egbochi ime — ọ naghị ebibi ime.",
        "age_group": "18+"
    },
    {
        "statement": "Ị nwere ike inweta HIV site n’iji toothbrush ma ọ bụ towel otu.",
        "is_myth": True,
        "explanation": "Ụgha! HIV anaghị ebu site n’iji ihe ọnụ — ọ na-ebufe site n’ime mmụọ dị ka ọbara, semen, wdg.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịṅa ọgwụ mgbochi ime na-echekwa gị pụọ na STI.",
        "is_myth": True,
        "explanation": "Ụgha! Ọgwụ mgbochi ime na-echekwa megide ime naanị — ọ naghị echebe megide STIs.",
        "age_group": "14-17"
    },
    {
        "statement": "Ị gaghị enweta STI site na ịnọ n’oche ụlọ mposi.",
        "is_myth": False,
        "explanation": "Eziokwu! STIs anaghị ebi ogologo oge na elu, ya mere ha apụghị isite na ụlọ mposi bịa.",
        "age_group": "14-17"
    },
    {
        "statement": "Ụgwọ mgbochi ime na-akpata ibu n’ahụ mmadụ niile.",
        "is_myth": True,
        "explanation": "Ụgha! Ọ bụghị mmadụ niile ka ibu na-abịara — ọ dabere n’ahụ mmadụ na ụdị ọgwụ ahụ.",
        "age_group": "18+"
    },
    {
        "statement": "Naanị ndị na-agba ọsọ n’ime mmekọahụ kwesịrị ileba STI anya.",
        "is_myth": True,
        "explanation": "Ụgha! Onye ọ bụla na-eme mmekọahụ kwesịrị ileba STI anya mgbe niile, n’agbanyeghị ọnụ ọgụgụ ndị ha sọrọ.",
        "age_group": "18+"
    },
    {
        "statement": "STIs nwere ike imetụta ịdị ime mmadụ n’ọdịnihu.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na a hapụrụ STIs n’enweghị ọgwụ, ha nwere ike imetụta mmadụ ịdị ime.",
        "age_group": "18+"
    },
    {
        "statement": "Ị gaghị enweta HIV ma ọ bụrụ na mmadụ abụọ dị ka ha dị mma.",
        "is_myth": True,
        "explanation": "Ụgha! Ọtụtụ ndị nwere HIV anaghị egosi ihe mgbaàmà — nnwale bụ ụzọ a pụrụ ịdabere na ya.",
        "age_group": "14-17"
    },
    {
        "statement": "Naanị ụmụ nwanyị kwesịrị iche banyere mgbochi ime.",
        "is_myth": True,
        "explanation": "Ụgha! Ichekwa ime na STI bụ ọrụ mmadụ abụọ.",
        "age_group": "14-17"
    },
    {
        "statement": "STIs anaghị ebu nnukwu nsogbu nye ụmụ nwoke dị ka ha si eme ụmụ nwanyị.",
        "is_myth": True,
        "explanation": "Ụgha! STIs nwere ike inye nsogbu ahụ ike n’aka mmadụ ọ bụla ma ọ bụrụ na e hapụghị ha.",
        "age_group": "14-17"
    },
    {
        "statement": "Ị nwere ike inwe ime ọbụna ma ọ bụ oge mbụ ka i mere mmekọahụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Ị nwere ike inwe ime oge ọ bụla i meere mmekọahụ na-enweghị nchekwa — ọbụna oge mbụ.",
        "age_group": "14-17"
    },
    {
        "statement": "Ị kwesịrị ileta dọkịta ozugbo ma i chee na i nwere STI.",
        "is_myth": False,
        "explanation": "Eziokwu! Ite ọgwụ n’oge na-egbochi nsogbu ọzọ na ime ka o kesaa.",
        "age_group": "18+"
    },
    {
        "statement": "Ịgwa onye mmekọ gị maka mmekọahụ na-eme ka ntụrụndụ gafee.",
        "is_myth": True,
        "explanation": "Ụgha! Ịkparịta ụka n’otu n’otu na-ewu ntụkwasị obi, nchekwa, na ahụ iru ala.",
        "age_group": "18+"
    },
    {
        "statement": "Ị nwere ike inweta STI n’oge mbụ i meere mmekọahụ.",
        "is_myth": False,
        "explanation": "Eziokwu! A pụkwara ibuga STI n’oge ọbụla mmekọahụ na-enweghị nchekwa, ọbụna nke mbụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị gaghị enwe ime ma ọ bụrụ na ọ bụ oge mbụ i mere mmekọahụ.",
        "is_myth": True,
        "explanation": "Ụgha! Ị nwere ike inwe ime oge ọbụla i meere mmekọahụ na-enweghị nchekwa.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike ịmata ma mmadụ nwere STI site n’ịle ya.",
        "is_myth": True,
        "explanation": "Ụgha! Ọtụtụ STIs anaghị egosi ihe mgbaàmà. Ịnwale bụ ụzọ kacha mma.",
        "age_group": "10-13"
    },
    {
        "statement": "A pụkwara ibuga HIV site n’ọbara.",
        "is_myth": False,
        "explanation": "Eziokwu! HIV nwere ike ibufe site n’ọbara, semen, mmiri ime nwanyi, na mmiri ara.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị gaghị enweta HIV site n’ịkpa nkata, iri nri ọnụ, ma ọ bụ iji ụlọ mposi otu.",
        "is_myth": False,
        "explanation": "Eziokwu! HIV anaghị ebufe site n’ịkpa nkata ma ọ bụ iji ihe ọnụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Ụmụ agbọghọ agaghị enwe ime n’oge ha na-enwe menses.",
        "is_myth": True,
        "explanation": "Ụgha! Ọ bụ ihe na-adịghị eme ọtụtụ oge, ma o kwe omume ka sperm biri n’ahụ ruo ọtụtụ ụbọchị.",
        "age_group": "10-13"
    },
    {
        "statement": "Naanị ụmụ agbọghọ kwesịrị ịmụ maka STI na ime.",
        "is_myth": True,
        "explanation": "Ụgha! Onye ọ bụla kwesịrị ịghọta otú ime na STIs si eme na otú e si zere ha.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike inweta STI site na oral sex.",
        "is_myth": False,
        "explanation": "Eziokwu! STIs nwere ike ibufe site n’ọtụtụ ụdị mmekọahụ na-enweghị nchekwa.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị gaghị enwe ime site n’imeso ibe gị aka ma ọ bụ ifụ ọnụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Ime nwere ike ime naanị site n’ime mmekọahụ, ọ bụghị ifụ ọnụ.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs na-emekarị na ndị na-adịghị asacha ahụ.",
        "is_myth": True,
        "explanation": "Ụgha! STIs na-ebufe site na mmekọahụ — ọ bụghị n’ihi na mmadụ adịghị ọcha.",
        "age_group": "10-13"
    },
    {
        "statement": "Kondom na-enyere aka igbochi ime na STIs.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na eji ya nke ọma, kondom na-enyere aka igbochi ime na STIs.",
        "age_group": "10-13"
    },
    {
        "statement": "Naanị ndị okenye nwere ike inweta STIs.",
        "is_myth": True,
        "explanation": "Ụgha! Onye ọ bụla na-eme mmekọahụ nwere ike inweta STI.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị gaghị enweta STI ma mmadụ abụọ abụla ndị na-adịghị emekọta.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na mmadụ abụọ anaghị ewetaghachi mmekọahụ, ihe ize ndụ dị ala.",
        "age_group": "10-13"
    },
    {
        "statement": "E nwere ọgwụ mgbochi STIs ụfọdụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Dịka ọmụmaatụ, ọgwụ mgbochi HPV na-enyere aka igbochi cancer ụfọdụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike inweta HIV site n’ịtụ ya n’ọnyà mmị ọkụ.",
        "is_myth": True,
        "explanation": "Ụgha! HIV anaghị ebufe site n’ọnyà mmị ọkụ — ọ bụ site na mmụọ ụfọdụ n’ahụ.",
        "age_group": "10-13"
    },
    {
        "statement": "STIs nwere mgbaàmà dịka mịkọrọ ma ọ bụ mmiri si n’ahụ pụta.",
        "is_myth": True,
        "explanation": "Ụgha! Ọtụtụ STIs enweghị ihe mgbaàmà — nke a mere nwalee ji dị mkpa.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịsị kondom abụọ na-enye nchebe ka mma.",
        "is_myth": True,
        "explanation": "Ụgha! Ịsị abụọ nwere ike ime ka ha kụsie ibe ha, meekwa ka ha gbajie.",
        "age_group": "10-13"
    },
    {
        "statement": "Ndị nwere HIV nwere ike ibi ndụ ogologo oge ma ewere ọgwụ ha nke ọma.",
        "is_myth": False,
        "explanation": "Eziokwu! HIV nwere ọgwụ na-eme ka mmadụ biri ogologo ndụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Naanị ndị nwere ọtụtụ onye mmekọ na-enweta STIs.",
        "is_myth": True,
        "explanation": "Ụgha! Onye ọbụla na-eme mmekọahụ nwere ike inweta STI, ọbụna onye nwere naanị otu onye.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịsa ahụ mgbe e mechara mmekọahụ na-egbochi ime.",
        "is_myth": True,
        "explanation": "Ụgha! Ịsa ahụ anaghị egbochi ime ma ọ bụ STIs — naanị nchekwa ga-enyere.",
        "age_group": "10-13"
    },
    {
        "statement": "A pụkwara ịgwọ STIs ụfọdụ na antibayotik.",
        "is_myth": False,
        "explanation": "Eziokwu! STIs dịka chlamydia ma ọ bụ gonorrhea nwere ọgwụ — HIV anaghị agwọcha.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike inweta STI site n’oche ụlọ mposi.",
        "is_myth": True,
        "explanation": "Ụgha! STIs anaghị ebi ogologo oge na elu — ha agaghị ebufe site n’oche ụlọ mposi.",
        "age_group": "10-13"
    },
    {
        "statement": "Ọ dị mkpa ikwu okwu na onye toro eto ma i nwere mgbagwoju anya gbasara mmekọahụ, STI, ma ọ bụ ime.",
        "is_myth": False,
        "explanation": "Eziokwu! Onye toro eto nwere ike inye ozi ziri ezi na enyemaka.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike inwe ime ọbụlagodi sperm soro nso n’ụlọ nwaanyị.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na sperm bata n’ime, ime nwere ike ime ọbụna na enweghi mmekọahụ zuru oke.",
        "age_group": "10-13"
    },
    {
        "statement": "Ụgwụ mgbochi ime na-echebe pụọ na STI.",
        "is_myth": True,
        "explanation": "Ụgha! Ọgwụ mgbochi ime na-egbochi ime naanị — ọ naghị egbochi STI.",
        "age_group": "10-13"
    },
    {
        "statement": "Ndị nwere STI na-amata mgbe niile na ha nwere otu.",
        "is_myth": True,
        "explanation": "Ụgha! Ọtụtụ mmadụ enweghị mgbaàmà — nnwale bụ ụzọ iji mara.",
        "age_group": "10-13"
    },
    {
        "statement": "Ụzọ ziri ezi 100% iji zere STIs na ime bụ izere mmekọahụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Inweghi mmekọahụ (abstinence) bụ ụzọ kacha echebe.",
        "age_group": "10-13"
    },
    {
        "statement": "Ọ dị mkpa ka ndị enyi gị na-agwa gị ihe gbasara mmekọahụ, STI, na ime.",
        "is_myth": True,
        "explanation": "Ụgha! Enyi nwere ike inye ozi na-ezighị ezi. Tọọ anya n'aka ndị toro eto kwụụrụ ntụkwasị obi.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike ịmụ ime site n’ịkwatu n’akụkụ nwanyị.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na sperm rutere nso, o kwe omume ka ime mee.",
        "age_group": "10-13"
    },
    {
        "statement": "Mmekọahụ nwere ike imetụta mmetụta uche na ahụike mmụọ.",
        "is_myth": False,
        "explanation": "Eziokwu! Mmekọahụ nwere mmetụta n’echiche, mmetụta uche, na ahụike.",
        "age_group": "10-13"
    },
    {
        "statement": "Iji kondom bụ ụzọ kacha echebe mgbe mmadụ na-eme mmekọahụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Ọ bụrụ na eji ya nke ọma, kondom na-enye nchebe pụọ na ime na STIs.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike igbochi ime site n’ịfụ ọkpụkpọ dị ọkụ ozugbo mgbe e mechara.",
        "is_myth": True,
        "explanation": "Ụgha! Nke a abụghị ụzọ mgbochi ime. Zere mmekọahụ ma ọ bụ jiri condom.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike inweta STI ọbụna mgbe mmadụ anaghị eme mmekọahụ.",
        "is_myth": True,
        "explanation": "Ụgha! STIs na-ebufe site n’ime mmekọahụ, ọ bụghị site na ịdị nso naanị.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike inweta HIV site n’ifụ ọnụ.",
        "is_myth": True,
        "explanation": "Ụgha! Ihe ize ndụ dị oke ala, ma ọ bụrụ na ọ nwere ọnyá n’ọnụ, o kwe omume.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike ichebe onwe gị site n’ịmụ banyere ahụike mmekọahụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Ịmụ gbasara mmekọahụ na-enye gị ọgụgụ isi ime mkpebi ziri ezi.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịzụlite mmekọrịta kwesịrị ịdị na mgbagwoju anya mmekọahụ.",
        "is_myth": True,
        "explanation": "Ụgha! Ịhụnanya na ntụkwasị obi abụghị maka mmekọahụ naanị.",
        "age_group": "10-13"
    },
    {
        "statement": "Ndị mmadụ niile nwere mmekọahụ.",
        "is_myth": True,
        "explanation": "Ụgha! Ọ bụghị onye ọ bụla na-eme mmekọahụ — onye ọ bụla nwere nhọrọ nke ya.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị nwere ike isị ‘mba’ na mmekọahụ ọbụlagodi ma ị kwetara mbu.",
        "is_myth": False,
        "explanation": "Eziokwu! Ị nwere ike gbanwee uche gị n’oge ọbụla. Nkwenye bụ mgbe niile.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịsị mba pụtara na i chọghị ka emetụ gị aka.",
        "is_myth": False,
        "explanation": "Eziokwu! A ga-asọpụrụ oke gị mgbe niile.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị gaghị ekwu okwu banyere mmekọahụ n’ụlọ akwụkwọ.",
        "is_myth": True,
        "explanation": "Ụgha! Ụlọ akwụkwọ kwesịrị inye ihe ọmụma banyere ahụike mmekọahụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Nchekwa onwe gị bụ naanị ọrụ ndị okenye.",
        "is_myth": True,
        "explanation": "Ụgha! Ịmụ ka esi echebe onwe gị dị mkpa site n’oge nwata.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịghọta omume mmekọahụ gị na-enyere gị ime mkpebi ka mma.",
        "is_myth": False,
        "explanation": "Eziokwu! Ịmara onwe gị na-enyere ka i ghara ịbanye n’ihe i chọghị.",
        "age_group": "10-13"
    },
    {
        "statement": "Ọ dị mma ikwu okwu na nne na nna ma ọ bụ onye nlekọta banyere mmekọahụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Ndị toro eto nwere ike inye nduzi na nkwado.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị chọrọ inwe mmekọahụ iji bụrụ nwoke ma ọ bụ nwanyị n’ezie.",
        "is_myth": True,
        "explanation": "Ụgha! Ibu nwoke ma ọ bụ nwanyị enweghị ihe jikọtara ya na mmekọahụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Ụmụaka kwesịrị ịmụta gbasara ahụ ha na mmepe mmekọahụ.",
        "is_myth": False,
        "explanation": "Eziokwu! Ịmara ka ahụ si arụ ọrụ na-enyere ka e nwee nchebe na ntụkwasị obi.",
        "age_group": "10-13"
    },
    {
        "statement": "Ọbụna mgbe i meere naanị oral sex, ị ka nwere ike inweta STI.",
        "is_myth": False,
        "explanation": "Eziokwu! STIs dịka herpes, gonorrhea, HPV nwere ike ibufe site na oral sex.",
        "age_group": "10-13"
    },
    {
        "statement": "Nwoke anaghị achọ nkwenye tupu mmekọahụ.",
        "is_myth": True,
        "explanation": "Ụgha! Nkwenye dị mkpa n’otu n’otu maka mmekọahụ ọbụla.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịmụ banyere condom kwesịrị ime mgbe mmadụ malitere ime mmekọahụ.",
        "is_myth": True,
        "explanation": "Ụgha! Ọ kacha mma ịmụta tupu oge eruo, ka a mara ka esi echebe onwe.",
        "age_group": "10-13"
    },
    {
        "statement": "Ị ga-ekwupụta ihe ọ bụla metụtara na-emetụ aka n’enweghị nkwenye.",
        "is_myth": False,
        "explanation": "Eziokwu! Ị kwesịrị ikwupụta ma chọọ enyemaka mgbe ihe na-eme na-akọ.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịnọgide na-emekọahụ ka i wee debe onye mmekọ gị.",
        "is_myth": True,
        "explanation": "Ụgha! Ọhụrụ mmekọahụ kwesịrị ịbụ na mkpokọta nkwenye, ọ bụghị n’ihe mgbali.",
        "age_group": "10-13"
    },
    {
        "statement": "Ịmara ihe gbasara STI na ime na-enye aka ịchebe onwe.",
        "is_myth": False,
        "explanation": "Eziokwu! Ịmara eziokwu na enyere aka izere ihe ize ndụ.",
        "age_group": "10-13"
    },
    {
        "statement": "Ọ bụ onye nwoke ga-eme mkpebi banyere condom.",
        "is_myth": True,
        "explanation": "Ụgha! Mkpebi gbasara nchekwa bụ ọrụ onye ọ bụla.",
        "age_group": "10-13"
    }
]





quiz_data_hausa = [
    {
        "statement": "Ba za ki iya daukar ciki ba a lokacin da kika fara yin jima'i.",
        "is_myth": True,
        "explanation": "Karya ce! Za a iya ɗaukar ciki kowane lokaci idan aka yi jima'i ba tare da kariya ba — ko da kuwa shi ne karo na farko.",
        "age_group": "14-17",
    },
    {
        "statement": "Kondom na karewa daga daukar ciki da kuma cututtukan jima'i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Idan an yi amfani da kondom yadda ya kamata, yana rage haɗarin daukar ciki da yawancin cututtukan jima'i.",
        "age_group": "14-17",
    },
    {
        "statement": "Amfani da kondom biyu na bada kariya fiye da ɗaya.",
        "is_myth": True,
        "explanation": "Karya ce! Amfani da kondom biyu zai iya jawo gogayya tsakaninsu wanda zai iya jawo su fashe.",
        "age_group": "18+",
    },
    {
        "statement": "Ana iya yada cutar HIV ta cizon sauro.",
        "is_myth": True,
        "explanation": "Karya ce! Ba a iya yada HIV ta hanyar cizon sauro — sai dai ta wasu ruwan jiki ne kawai.",
        "age_group": "10-13",
    },
    {
        "statement": "Yin wanka ko yin fitsari bayan jima'i na hana daukar ciki.",
        "is_myth": True,
        "explanation": "Karya ce! Yin wanka ko fitsari bayan jima'i ba zai hana daukar ciki ba.",
        "age_group": "14-17",
    },
    {
        "statement": "Cututtukan jima'i sukan kama masu yawan jima'i ne kawai.",
        "is_myth": True,
        "explanation": "Karya ce! Duk wanda ke yin jima'i zai iya kamuwa da cutar STI, ba tare da la'akari da yawan abokan jima'i ba.",
        "age_group": "14-17",
    },
    {
        "statement": "Kwayoyin hana daukar ciki na sa mace ta zama marar haihuwa har abada.",
        "is_myth": True,
        "explanation": "Karya ce! Kwayoyin hana daukar ciki ana iya dakatar da su kuma ba sa hana haihuwa har abada.",
        "age_group": "18+",
    },
    {
        "statement": "Cututtukan jima'i koyaushe suna nuna alamu.",
        "is_myth": True,
        "explanation": "Karya ce! Wasu cututtuka na jima'i ba su da alamu. Shi ya sa yana da muhimmanci a duba kai.",
        "age_group": "14-17",
    },
    {
        "statement": "Ba za a iya kamuwa da STI ba idan ku biyun baku taba jima'i ba.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Idan babu ɗaya daga cikin ku da ya taba jima'i, haɗarin kamuwa da STI yana da ƙanƙanta.",
        "age_group": "14-17",
    },
    {
        "statement": "Hanyar cire gaba kafin fitar maniyyi wata kariya ce mai inganci.",
        "is_myth": True,
        "explanation": "Karya ce! Wannan hanya ba ta da aminci sosai, saboda maniyyi na iya fita tun kafin fitar gaba gaba ɗaya.",
        "age_group": "14-17",
    },
    {
        "statement": "HPV (Human Papillomavirus) na iya haifar da cutar sankarar mahaifa.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Wasu nau’in HPV na iya haifar da sankarar mahaifa, saboda haka rigakafi yana da muhimmanci.",
        "age_group": "14-17",
    },
    {
        "statement": "Ba lallai ne a yi amfani da kariya yayin yin jima'i da baki ba.",
        "is_myth": True,
        "explanation": "Karya ce! Ana iya kamuwa da STIs ta hanyar jima'i da baki — yana da kyau a yi amfani da kariya.",
        "age_group": "18+",
    },
    {
        "statement": "Maza ba su iya kamuwa da cutar HPV ba.",
        "is_myth": True,
        "explanation": "Karya ce! Maza ma na iya kamuwa da HPV kuma hakan na iya jawo wasu matsalolin lafiya.",
        "age_group": "14-17",
    },
    {
        "statement": "Maganin gaggawa na hana daukar ciki ana amfani da shi ne rana guda bayan jima'i kawai.",
        "is_myth": True,
        "explanation": "Karya ce! Maganin gaggawa na iya aiki har zuwa kwana 3–5 bayan jima'i.",
        "age_group": "18+",
    },
    {
        "statement": "Ba za a iya daukar ciki yayin al'ada ba.",
        "is_myth": True,
        "explanation": "Karya ce! Duk da yake ba kasafai ba ne, amma ana iya daukar ciki yayin al’ada saboda maniyyi na iya rayuwa a jiki na tsawon kwanaki.",
        "age_group": "14-17",
    },
    {
        "statement": "Za ka iya gane wanda ke da STI ta kallonsa.",
        "is_myth": True,
        "explanation": "Karya ce! Yawancin STIs ba sa nuna alamu, kawai gwaji ne zai tabbatar da su.",
        "age_group": "14-17",
    },
    {
        "statement": "Kondom na da ƙarewa, kuma ya kamata a watsar da su idan sun ƙare.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Amfani da kondom da ya ƙare zai iya fashewa — kullum duba ranar ƙarewa.",
        "age_group": "14-17",
    },
    {
        "statement": "Yin wanka a farji bayan jima'i yana hana STIs.",
        "is_myth": True,
        "explanation": "Karya ce! Douching ba ya karewa daga STIs, kuma yana iya dagula yanayin farji.",
        "age_group": "18+",
    },
    {
        "statement": "Kwayar gaggawa da ake sha bayan jima'i daidai take da zubar da ciki.",
        "is_myth": True,
        "explanation": "Karya ce! Maganin gaggawa yana hana daukar ciki ne — ba ya kawo ƙarshen ciki.",
        "age_group": "18+",
    },
    {
        "statement": "Ana iya kamuwa da HIV ta hanyar amfani da buroshi ko tawul ɗaya da wanda ke da cutar.",
        "is_myth": True,
        "explanation": "Karya ce! HIV ba ya yaduwa ta hulɗar yau da kullum — sai dai ta jini, maniyyi, ruwan farji ko nono.",
        "age_group": "10-13",
    },
    {
        "statement": "Amfani da kwayoyin hana daukar ciki na hana STIs.",
        "is_myth": True,
        "explanation": "Karya ce! Kwayoyin hana ciki suna hana ciki ne kawai — ba su karewa daga cututtukan jima'i.",
        "age_group": "14-17",
    },
    {
        "statement": "Ba za ka iya kamuwa da STI daga kujera a bayan gida ba.",
        "is_myth": False,
        "explanation": "Gaskiya ne! STIs ba su rayuwa tsawon lokaci a saman abubuwa kuma ba a yada su ta hanyar zama a bayan gida.",
        "age_group": "14-17",
    },
    {
        "statement": "Kwayar hana ciki tana sa mutum ya kara kiba duka lokaci.",
        "is_myth": True,
        "explanation": "Karya ce! Ba kowa ke kara kiba ba — sakamakon yana bambanta daga mutum zuwa mutum da nau’in maganin.",
        "age_group": "18+",
    },
    {
        "statement": "Mutane masu yawan abokan jima'i ne kawai ke bukatar gwajin STI.",
        "is_myth": True,
        "explanation": "Karya ce! Duk wanda ke yin jima'i ya kamata ya rika yin gwajin STI a kai a kai.",
        "age_group": "18+",
    },
    {
        "statement": "STIs na iya shafar haihuwa.",
        "is_myth": False,
        "explanation": "Gaskiya ne! STIs kamar chlamydia da gonorrhea idan ba a warkar da su ba na iya haifar da matsalar haihuwa.",
        "age_group": "18+",
    },
    {
        "statement": "Ba za ka iya kamuwa da HIV ba idan ku duka kuna da koshin lafiya a bayyane.",
        "is_myth": True,
        "explanation": "Karya ce! Mutum na iya kasancewa da HIV ba tare da alamu ba — kawai gwaji ne zai tabbatar.",
        "age_group": "14-17",
    },
    {
        "statement": "Mata ne kawai ke da alhakin hana daukar ciki.",
        "is_myth": True,
        "explanation": "Karya ce! Hana ciki da STIs alhaki ne da ke kan ma’aurata duka.",
        "age_group": "14-17",
    },
    {
        "statement": "STIs ba su da hadari sosai ga maza fiye da mata.",
        "is_myth": True,
        "explanation": "Karya ce! STIs na iya haddasa matsaloli masu tsanani ga kowane jinsi idan ba a yi magani ba.",
        "age_group": "14-17",
    },
    {
        "statement": "Za a iya daukar ciki ko da karo na farko ne na jima’i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Daukar ciki na iya faruwa a duk lokacin da aka yi jima'i ba tare da kariya ba — har da karo na farko.",
        "age_group": "14-17",
    },
    {
        "statement": "Ya kamata mutum ya ga likita da gaggawa idan yana zargin yana da STI.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Maganin gaggawa zai hana matsaloli kuma ya hana yada cutar ga wasu.",
        "age_group": "18+",
    },
    {
        "statement": "Magana akan jima’i da abokin zama yana lalata yanayi.",
        "is_myth": True,
        "explanation": "Karya ce! Tattaunawa da budewa yana kara amana, tsaro da jin dadi yayin jima'i.",
        "age_group": "18+",
    },
    {
        "statement": "Za ka iya kamuwa da STI a karo na farko da ka yi jima’i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Ana iya kamuwa da STIs koda karo na farko idan ba a yi amfani da kariya ba.",
        "age_group": "10-13",
    },
    {
        "statement": "Ba za ki iya daukar ciki ba idan wannan shi ne karo na farko da kika yi jima’i.",
        "is_myth": True,
        "explanation": "Karya ce! Za ki iya daukar ciki duk lokacin da aka yi jima’i ba tare da kariya ba — har da karo na farko.",
        "age_group": "10-13",
    },
    {
        "statement": "Za ka iya gane wanda ke da STI ta hanyar duban su.",
        "is_myth": True,
        "explanation": "Karya ce! Yawancin STIs ba su da alamu. Gwaji ne kawai ke tabbatarwa.",
        "age_group": "10-13",
    },
    {
        "statement": "Ana iya yada HIV ta jini.",
        "is_myth": False,
        "explanation": "Gaskiya ne! HIV na iya yaduwa ta jini, maniyyi, ruwan farji, da nono.",
        "age_group": "10-13",
    },
    {
        "statement": "Ba za ka iya kamuwa da HIV ta runguma, cin abinci tare ko amfani da bayan gida ɗaya ba.",
        "is_myth": False,
        "explanation": "Gaskiya ne! HIV ba ya yaduwa ta hulɗar yau da kullum.",
        "age_group": "10-13",
    },
    {
        "statement": "Mata ba za su iya daukar ciki ba yayin al’ada.",
        "is_myth": True,
        "explanation": "Karya ce! Kodayake ba kasafai ba ne, amma za a iya daukar ciki saboda maniyyi na iya rayuwa a jiki.",
        "age_group": "10-13",
    },
    {
        "statement": "Ilimi akan STIs da ciki ya dace da mata kawai.",
        "is_myth": True,
        "explanation": "Karya ce! Kowa ya kamata ya fahimci yadda STIs da ciki ke faruwa da hanyoyin kare kai.",
        "age_group": "10-13",
    },
    {
        "statement": "Za ka iya kamuwa da STI ta hanyar jima’i da baki.",
        "is_myth": False,
        "explanation": "Gaskiya ne! STIs na iya yaduwa ta duk wani nau'in jima’i da ba a yi amfani da kariya ba.",
        "age_group": "10-13",
    },
    {
        "statement": "Ba za ki iya daukar ciki ba ta sumbata ko riƙe hannu.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Ciki yana faruwa ne ta hanyar jima’i — ba daga sumbata ko taɓawa ba.",
        "age_group": "10-13",
    },
    {
        "statement": "STIs sukan kama ne ga wadanda ba sa wanka ko tsafta.",
        "is_myth": True,
        "explanation": "Karya ce! STIs na yaduwa ne ta jima’i — ba wai saboda rashin tsafta ba.",
        "age_group": "10-13",
    },
    {
        "statement": "Kondom na karewa daga ciki da kuma STIs.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Lokacin da aka yi amfani da su yadda ya dace, kondom na taimakawa wajen karewa daga ciki da STIs.",
        "age_group": "10-13",
    },
    {
        "statement": "STIs na faruwa ne ga manya kawai.",
        "is_myth": True,
        "explanation": "Karya ce! Duk wanda ke da jima’i na iya kamuwa da STI, ko da matashi ne.",
        "age_group": "10-13",
    },
    {
        "statement": "Ba za ka iya kamuwa da STI ba idan ku biyun budurwoyi ne.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Idan babu ɗaya daga cikin ku da ya taba jima’i, haɗari na STI yana da ƙanƙanta.",
        "age_group": "10-13",
    },
    {
        "statement": "Akwai alluran rigakafi don hana wasu STIs.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Rigakafin HPV na kare daga wasu nau’in cutar da ke jawo ciwon daji.",
        "age_group": "10-13",
    },
    {
        "statement": "Za ka iya kamuwa da HIV daga cizon sauro.",
        "is_myth": True,
        "explanation": "Karya ce! HIV ba ya yaduwa ta cizon sauro — sai dai ta jini ko wasu ruwan jiki.",
        "age_group": "10-13",
    },
    {
        "statement": "STIs koyaushe suna da alamu kamar ƙaiƙayi ko zubar ruwa.",
        "is_myth": True,
        "explanation": "Karya ce! Wasu STIs ba su nuna alamu — shi ya sa gwaji ke da mahimmanci.",
        "age_group": "10-13",
    },
    {
        "statement": "Amfani da kondom biyu na kariya sosai.",
        "is_myth": True,
        "explanation": "Karya ce! Amfani da kondom biyu zai iya sa su gogewa da juna wanda zai iya jawo fashewa.",
        "age_group": "10-13",
    },
    {
        "statement": "Mutane masu HIV za su iya rayuwa lafiya da dogon lokaci da magani.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Tare da magani mai kyau, masu HIV na iya rayuwa lafiya da tsawon lokaci.",
        "age_group": "10-13",
    },
    {
        "statement": "Mutane masu yawan abokan jima’i ne kawai ke kamuwa da STIs.",
        "is_myth": True,
        "explanation": "Karya ce! Duk wanda ke da jima’i na iya kamuwa da STI, ko da da mutum ɗaya ne.",
        "age_group": "10-13",
    },
    {
        "statement": "Yin wanka bayan jima’i na hana ciki.",
        "is_myth": True,
        "explanation": "Karya ce! Wanka ba ya hana ciki ko STIs — kariya kawai ke aiki.",
        "age_group": "10-13",
    },
    {
        "statement": "Ana iya warkar da STIs da maganin ƙwayoyi.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Wasu STIs kamar chlamydia da gonorrhea ana warkar da su — wasu kuwa ana iya sarrafawa.",
        "age_group": "10-13",
    },
    {
        "statement": "Kujerar bayan gida na iya yada STIs.",
        "is_myth": True,
        "explanation": "Karya ce! STIs ba sa rayuwa tsawon lokaci a saman abubuwa kuma ba sa yaduwa ta kujerun bayan gida.",
        "age_group": "10-13",
    },
    {
        "statement": "Yana da muhimmanci a tattauna da babban mutum idan kana da rashin fahimta akan jima’i, STIs ko ciki.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Babban mutum da aka yarda da shi na iya ba da sahihin bayani.",
        "age_group": "10-13",
    },
    {
        "statement": "Za ki iya daukar ciki idan maniyyi ya shiga kusa da farji, ko ba a yi cikakken jima’i ba.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Ciki na iya faruwa idan maniyyi ya shiga cikin farji, koda ba a yi cikakken jima’i ba.",
        "age_group": "10-13",
    },
    {
        "statement": "Kwayoyin hana ciki na karewa daga STIs.",
        "is_myth": True,
        "explanation": "Karya ce! Kwayoyin hana ciki suna hana ciki ne kawai — ba su kare daga STIs.",
        "age_group": "10-13",
    },
    {
        "statement": "Mutane masu STI koyaushe sukan san suna da cutar.",
        "is_myth": True,
        "explanation": "Karya ce! Mutane da yawa ba su da alamomi sai dai idan sun yi gwaji.",
        "age_group": "10-13",
    },
    {
        "statement": "Hanyar da tafi tabbaci don gujewa STIs da ciki ita ce kada a yi jima’i kwata-kwata.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Kin yin jima’i gaba daya shi ne hanyar da tafi tabbatar da kariya.",
        "age_group": "10-13",
    },
    {
        "statement": "Duk wanda ke jima’i dole ne ya san yadda zai kare kansa daga ciki da STIs.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Ilimi da kariya na da matuƙar muhimmanci ga lafiyar jima’i.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Ana iya kamuwa da STI ko da aka yi amfani da kondom.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Kondom yana rage haɗari sosai, amma ba kariya kashi ɗari cikin ɗari ba ce.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Zai fi kyau a yi shiru game da STIs domin kunya.",
        "is_myth": True,
        "explanation": "Karya ce! Yin magana akan STIs na taimakawa wajen kariya, warkewa da ilimantarwa.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Za a iya kamuwa da STI fiye da sau ɗaya.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Ko da ka warke, za ka iya sake kamuwa idan ba ka kiyaye ba.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Kondom ba su da amfani idan mutum ɗaya ne kawai ya fi shan wahala daga ciki ko STIs.",
        "is_myth": True,
        "explanation": "Karya ce! Duk abokan jima’i suna da alhakin kare juna da kansu.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Za ka iya kamuwa da STI daga amfani da abin share goge ko tufafi tare da wani.",
        "is_myth": True,
        "explanation": "Karya ce! STIs yawanci na yaduwa ne ta jima’i kai tsaye, ba ta tufafi ba.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Mutum ba zai iya kamuwa da STI idan yana da tsafta sosai ba.",
        "is_myth": True,
        "explanation": "Karya ce! STIs ba su da alaƙa da tsafta — kariya da gwaji ne mafita.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Cutar HPV na iya jawo ciwon daji na mahaifa.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Saboda haka rigakafin HPV yana da matuƙar muhimmanci.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Ana iya yin rigakafin HPV kafin ka fara jima’i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Wannan lokaci ne mafi inganci don rigakafin.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Amfani da sabulu ko ruwa bayan jima’i yana kashe kwayar cuta.",
        "is_myth": True,
        "explanation": "Karya ce! Sabulu ba ya kashe STIs a ciki ko wajen farji.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Wasu STIs za su iya shafar haihuwa idan ba a yi magani ba.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Wasu STIs na iya haifar da matsalolin haihuwa idan ba a kula da su ba.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Idan ka ji daɗin jima’i, ba za ka iya kamuwa da STI ba.",
        "is_myth": True,
        "explanation": "Karya ce! Jin daɗin jima’i ba ya hana kamuwa da cuta — kariya ce kawai ke taimakawa.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Ana iya kamuwa da STIs ta hanyar amfani da abun wasa na jima’i tare da wani.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Idan ba a wanke ko saka kariya ba, yana iya yaduwar kwayar cuta.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "STIs na shafar kowa da kowa — babu bambanci a jinsi, shekaru ko jinsi.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Kowa yana da damar kamuwa da STI idan ya shiga haɗarin jima’i.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Kin yin jima’i ko amfani da kariya ba alama ce ta rashin soyayya ba.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Kare kai da lafiyar jima’i wani nau’i ne na nuna soyayya.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Idan ka amince da wani, babu bukatar amfani da kondom.",
        "is_myth": True,
        "explanation": "Karya ce! Amana ba ta maye gurbin gwaji da kariya ba.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Za a iya hana yaduwar HIV da amfani da magunguna kafin ko bayan hulɗar jima’i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Magungunan PrEP da PEP na rage yaduwar HIV sosai.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Yana da muhimmanci mu mutunta yanke shawarar kowa dangane da jima’i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Yarda da girmamawa suna da matuƙar muhimmanci wajen hulɗar lafiya.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Idan wani yana matsa maka yin jima’i, hakan yana nuna ba a girmama ka ba.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Yarda dole ne ta kasance daga bangarorin biyu — matsin lamba ba abu ne mai kyau ba.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Shan giya ko miyagun ƙwayoyi na iya shafar yadda mutum ke yanke shawara akan jima’i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Wadannan abubuwa na rage tunani mai kyau kuma na iya jawo haɗari.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Kowa yana da hakkin samun bayani da lafiya dangane da jima’i da jikinsa.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Ilimi game da lafiyar jima’i hakki ne na kowa da kowa.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Ba kowa ne ke da lafiya idan yana da STI ba.",
        "is_myth": True,
        "explanation": "Karya ce! Yawancin STIs ana iya magance su kuma ba su hana mutum lafiya da mutunci ba.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Zaka iya tambayar asibiti ko makaranta don karin bayani game da STIs.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Ma’aikatan lafiya da malamai na iya ba da sahihan bayanai masu amfani.",
        "age_group": "10-13",
        "language": "Hausa"
    },
    {
        "statement": "Zan iya tambayarka tambayoyi game da STIs da lafiyar jima’i.",
        "is_myth": False,
        "explanation": "Gaskiya ne! Tattaunawa na taimaka wajen karin fahimta da tsare kai.",
        "age_group": "10-13",
        "language": "Hausa"
    }
]
